ВыгрузкаБСПРесторан/Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагружаетсяИзИнтернета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ВыгрузкаБСПРесторан/CommonModules/ЦентрМониторингаПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняется при запуске регламентного задания.
//
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
		
	// Собрать статистику по количеству каждого вида номенклатуры.
	// В регистр сведений <СтатистикаКонфигураций> будут внесен набор записей следующего состава.
	//
	// Справочник.Номенклатура.ВидНоменклатуры1	Количество1
	// Справочник.Номенклатура.ВидНоменклатуры2	Количество2
	// ...
	// Справочник.Номенклатура.ВидНоменклатурыN	КоличествоN.
	СоответствиеИменМетаданных = Новый Соответствие;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВидНоменклатуры КАК ВидНоменклатуры,
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ВидНоменклатуры
	|";
	СоответствиеИменМетаданных.Вставить("Справочник.Номенклатура", ТекстЗапроса);
	
	ЦентрМониторинга.ЗаписатьСтатистикуКонфигурации(СоответствиеИменМетаданных);

	

	// Собрать статистику по способу установки курса справочника Валюты.
	// В регистр сведений <СтатистикаКонфигураций> будут внесена записи следующего вида.
	//
	// Справочник.Валюты.СпособУстановкиКурса1		Количество1
	// Справочник.Валюты.СпособУстановкиКурса2		Количество2
	// ...
	// Справочник.Валюты.СпособУстановкиКурсаN		КоличествоN.
	СоответствиеИменМетаданных = Новый Соответствие;
	
	ТекстЗапроса = "ВЫБРАТЬ
				   |	СпособУстановкиКурса КАК СпособУстановкиКурса,
				   |	КОЛИЧЕСТВО(*) КАК Количество
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |СГРУППИРОВАТЬ ПО
	               |	СпособУстановкиКурса
				   |";
	СоответствиеИменМетаданных.Вставить("Справочник.Валюты", ТекстЗапроса);
	
	ЦентрМониторинга.ЗаписатьСтатистикуКонфигурации(СоответствиеИменМетаданных);
	
	// Собрать статистику по количество валют, курс которых загружается через интернет.
	// В регистр сведений <СтатистикаКонфигураций> будут внесена запись следующего вида
	// Справочник.Валюты.ЗагружаетсяИзИнтернета		Количество.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК Количество
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |ГДЕ
	               |	Валюты.СпособУстановкиКурса = &СпособУстановкиКурса";
				   
	Запрос.УстановитьПараметр("СпособУстановкиКурса", Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЦентрМониторинга.ЗаписатьСтатистикуОбъектаКонфигурации("Справочник.Валюты.ЗагружаетсяИзИнтернета", Выборка.Количество);
КонецПроцедуры

// Задает настройки, применяемые как умолчания для объектов подсистемы.
//
// Параметры:
//   Настройки - Структура - Коллекция настроек подсистемы. Реквизиты:
//       * ВключитьОповещение - Булево - Умолчание для оповещений пользователя:
//           Истина - По умолчанию оповещаем администратора системы, например, если нет подсистемы "Текущие дела".
//           Ложь   - По умолчанию не оповещаем администратора системы.
//           Значение по умолчанию: зависит от наличия подсистемы "Текущие дела".                              
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	

	Настройки.ВключитьОповещение = Истина;
	
КонецПроцедуры


#КонецОбласти
